{"config": {"layers": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "name": "conv2_1", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "dtype": "float32", "trainable": true, "filters": 16, "kernel_size": [3, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 28, 28, 1], "data_format": "channels_last", "padding": "same", "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "units": 4759, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_2"}}], "name": "sequential_1"}, "keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow"}